app/controllers/emails_controller.rb

  def index
    @emails = Email.all
---
SELECT * FROM `emails`

  def show
    @email = Email.find(params[:id])
---
SELECT * FROM `emails` WHERE (`emails`.`id` = 1)

  def edit
    @email = Email.find(params[:id])
---
SELECT * FROM `emails` WHERE (`emails`.`id` = 1)