app/controllers/email_addresses_controller.rb

SELECT * FROM `email_addresses`
---
  def index
    @email_addresses = EmailAddress.all

SELECT * FROM `email_addresses` WHERE (`email_addresses`.`id` = 24)
---
  def show
    @email_address = EmailAddress.find(params[:id])

SELECT * FROM `email_addresses` WHERE (`email_addresses`.`id` = 24)
---
  def edit
    @email_address = EmailAddress.find(params[:id])

SELECT * FROM `email_addresses` WHERE (`email_addresses`.`id` = 1)
DELETE FROM `email_addresses` WHERE `id` = 1
---
  def destroy
    @email_address = EmailAddress.find(params[:id])
    @email_address.destroy