app/controllers/index_controller.rb

  def index
    @thread = Email.find(:all, :conditions => "subject LIKE '%in the loop%'", :order => "created_at DESC")
---
SELECT * FROM `emails` WHERE (subject LIKE '%in the loop%') ORDER BY created_at DESC